{
  "title": "12 Angry Men",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A hot, claustrophobic jury room where twelve men prepare to deliberate a seemingly open-and-shut murder case.",
      "Theme Stated": "Justice is not just about facts; it’s about reasonable doubt, empathy, and moral responsibility.",
      "Set-Up": "The jurors gather, revealing their diverse backgrounds, prejudices, and initial eagerness to convict the boy without much discussion.",
      "Catalyst": "Juror 8 votes 'not guilty' for the first time, challenging the certainty of the others and introducing doubt.",
      "Debate": "Tensions rise as jurors argue, clash personalities, and confront their biases while dissecting the evidence.",
      "Break into Two": "Jurors agree to re-examine the case evidence piece by piece, moving from quick judgment to a detailed inquiry.",
      "B Story": "The evolving relationships among the jurors reveal themes of empathy, justice, and personal transformation.",
      "Fun and Games": "Juror 8 methodically dismantles the prosecution’s case, creating suspense and shifting alliances within the group.",
      "Midpoint": "A key piece of evidence—the uniqueness of the knife—is disproven, changing the momentum and casting serious doubt.",
      "Bad Guys Close In": "Some jurors resist changing their minds, personal biases flare, tempers explode, and the pressure mounts.",
      "All Is Lost": "Juror 3 vehemently threatens to quit; his personal pain and stubbornness seem to doom the possibility of consensus.",
      "Dark Night of the Soul": "The room falls silent; the weight of responsibility and the impossibility of truth in the case weigh heavily on everyone.",
      "Break into Three": "Juror 3’s resolve cracks after a powerful emotional confrontation, opening the door for final consensus.",
      "Finale": "The jury reaches unanimous 'not guilty' verdict, having confronted their prejudices and embraced justice over certainty.",
      "Final Image": "The jurors leave the room changed men; the oppressive heat has given way to calm, symbolizing enlightenment and growth."
    },
    "Hero’s Journey": {
      "Ordinary World": "The jurors enter the deliberation room, each with their own worldview and assumptions about guilt.",
      "Call to Adventure": "Juror 8’s dissenting vote calls the jury to question the case and seek deeper truth beyond appearances.",
      "Trials": "Through intense debates, personal confrontations, and re-examination of evidence, jurors face internal and external challenges.",
      "Ordeal": "The emotional climax as Juror 3 battles his own demons, nearly breaking the group’s fragile unity.",
      "Return": "With unanimous agreement reached, the jurors leave the room transformed, having embraced justice and empathy."
    },
    "Story Circle": {
      "You": "Twelve men, strangers bound by duty, convene to decide a young boy’s fate.",
      "Need": "They must determine the truth amid conflicting evidence and personal biases.",
      "Go": "Juror 8 challenges the easy verdict, pushing the group into deeper scrutiny.",
      "Search": "The jurors dissect testimonies, re-enact events, and confront their own prejudices.",
      "Find": "They discover inconsistencies and flaws in the prosecution’s case and in their own assumptions.",
      "Take": "Juror 3’s emotional breakdown forces the group to confront the human cost of their decision.",
      "Return": "The jury reaches a unanimous verdict of 'not guilty,' upholding justice through doubt and compassion.",
      "Change": "Each juror emerges transformed—more self-aware, empathetic, and responsible citizens."
    }
  }
}