{
  "title": "Arrival",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Louise teaches linguistics in a quiet, personal world — a solitary academic life filled with unspoken grief, setting the tone of introspection and isolation.",
      "Theme Stated": "In one of her early lectures, Louise emphasizes that language is the foundation of understanding — a concept that will grow to redefine her perception of time, memory, and love.",
      "Set-Up": "We learn about Louise's academic life and the world’s growing panic as twelve alien ships appear around the globe. Flashbacks suggest a deep emotional loss tied to her daughter.",
      "Catalyst": "Louise is approached by the military to translate the alien language. She travels to the landing site and sees the alien ship for the first time.",
      "Debate": "As she works with Ian and confronts the unknown, Louise questions her ability to understand the Heptapods and whether she’s emotionally prepared for the task.",
      "Break into Two": "Louise enters the alien ship and begins direct interaction. The process of decoding the language starts in earnest.",
      "B Story": "Louise and Ian's relationship quietly grows, grounded in their shared intellectual pursuit and mutual respect. Her internal transformation mirrors their developing bond.",
      "Fun and Games": "They make progress learning the alien symbols. Louise begins to dream — or remember — moments with her daughter. Language becomes a gateway to something more profound.",
      "Midpoint": "Louise realizes that the Heptapod language is affecting her cognition — she's not just translating it, she's thinking in it. Her visions become more vivid.",
      "Bad Guys Close In": "Tension escalates globally as other countries mistrust each other and the aliens. Louise’s sanity is questioned. The pressure mounts to extract answers from the Heptapods.",
      "All Is Lost": "China threatens military action. The U.S. prepares to evacuate. Louise feels isolated and fears failure — that war is inevitable and her work has been in vain.",
      "Dark Night of the Soul": "Louise’s visions become undeniable. She begins to accept that they’re not flashbacks, but premonitions — including seeing her daughter’s life and death.",
      "Break into Three": "Armed with this understanding, Louise returns to the Heptapods, fully embracing their language and perspective. She sees the whole of time.",
      "Finale": "Louise uses her new perception to contact General Shang in the future, preventing global war. She accepts the future she has seen — including her daughter’s birth and death.",
      "Final Image": "Louise stands with Ian, choosing to live a life of love and loss. Her understanding of time has changed, but she embraces each moment nonetheless."
    },
    "Hero’s Journey": {
      "Ordinary World": "Louise's life as a linguistics professor is quiet and melancholic, shadowed by the memory of her daughter's death.",
      "Call to Adventure": "She's approached by the U.S. military to help communicate with aliens whose ships have landed around the world.",
      "Trials": "She faces skepticism from the military, linguistic puzzles, and haunting visions that seem like memories. Her connection to the Heptapods deepens as she starts to 'think' in their language.",
      "Ordeal": "Louise learns that her visions are actually glimpses of the future, not the past — a shocking revelation that transforms her understanding of time and memory.",
      "Return": "Armed with this knowledge, Louise prevents a global crisis and makes the profound choice to live out a future filled with both love and inevitable loss."
    },
    "Story Circle": {
      "You": "Louise is isolated, grieving, and emotionally closed off, living a subdued life shaped by personal loss.",
      "Need": "She longs for connection, purpose, and healing — though she may not fully realize it yet.",
      "Go": "Louise agrees to help decode the alien language, embarking on a transformative journey into the unknown.",
      "Find": "Through the process of learning the Heptapods’ language, she discovers that time is not linear, and her 'memories' are in fact glimpses of what's to come.",
      "Return": "With this new perspective, Louise embraces a future she knows will include profound pain — choosing love and life despite knowing the ending."
    }
  }
}
