{
  "title": "Forrest Gump",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A feather floats gently through the air, landing at Forrest's feet on a bus stop bench, symbolizing the randomness and flow of life.",
      "Theme Stated": "Jenny tells Forrest, 'Life is like a box of chocolates, you never know what you're gonna get,' introducing the theme of unpredictability and destiny.",
      "Set-Up": "We see Forrest's childhood struggles with leg braces, his simple but loving relationship with his mother, and his deep bond with Jenny, establishing his innocence and pure-hearted nature.",
      "Catalyst": "Forrest discovers he can run effortlessly, breaking free from his physical limitations and changing his life trajectory.",
      "Debate": "Forrest grapples with understanding the complexities of the world around him, questioning his place while trying to follow Jenny's path and his mother's guidance.",
      "Break into Two": "Forrest enlists in the army, stepping into the wider, chaotic world beyond his sheltered upbringing.",
      "B Story": "The evolving relationship with Jenny, whose turbulent life contrasts with Forrest's steadfast optimism and loyalty.",
      "Fun and Games": "Forrest's extraordinary adventures: excelling in football, serving bravely in Vietnam, becoming a ping-pong champion, and inadvertently influencing major historical moments.",
      "Midpoint": "Forrest receives the Medal of Honor and learns of Jenny's pregnancy, a moment of triumph and deep personal revelation that raises the stakes emotionally.",
      "Bad Guys Close In": "Jenny's struggles with addiction and abusive relationships intensify, while Forrest faces the challenges of single fatherhood and uncertainty about the future.",
      "All Is Lost": "Jenny leaves Forrest and their son, creating a moment of profound loneliness and despair for Forrest.",
      "Dark Night of the Soul": "Forrest reflects on his life's journey, feeling lost but still holding onto hope fueled by memories and love.",
      "Break into Three": "Jenny returns, bringing Forrest and their son together, signaling a new chapter of healing and acceptance.",
      "Finale": "Forrest embraces fatherhood and the bittersweet reality of Jenny's illness, demonstrating resilience, unconditional love, and the cyclical nature of life.",
      "Final Image": "The feather reappears, carried by the wind as Forrest watches his son board the school bus, symbolizing the continuation of life’s unpredictable journey."
    },
    "Hero’s Journey": {
      "Ordinary World": "Forrest grows up in Greenbow, Alabama, living a simple life shaped by his physical challenges and sheltered upbringing.",
      "Call to Adventure": "His ability to run fast frees him from his leg braces and opens new possibilities beyond his small town.",
      "Trials": "Forrest navigates the complexities of war, fame, love, and loss, each experience shaping his innocent worldview and inner strength.",
      "Ordeal": "Facing the pain of Jenny's departure and raising their son alone, Forrest confronts his deepest fears and loneliness.",
      "Return": "Jenny returns and entrusts Forrest with their son, bringing Forrest full circle to a new life defined by love, responsibility, and hope."
    },
    "Story Circle": {
      "You": "Forrest Gump, a simple man with a kind heart and limited intellect, living a sheltered childhood.",
      "Need": "To find his place in a confusing, often cruel world and to connect with those he loves.",
      "Go": "He joins the army, embarks on adventures, and follows the twists of fate that life presents.",
      "Search": "Forrest experiences love, loss, and success, all while seeking meaning and belonging.",
      "Find": "He discovers fatherhood and the depth of unconditional love through his son and Jenny’s presence.",
      "Take": "He embraces responsibility and the hardships of caring for his family despite uncertainty and pain.",
      "Return": "Forrest settles into a quieter life, enriched by the lessons and connections forged through his journey.",
      "Change": "Though still simple, Forrest gains profound wisdom about life’s unpredictability, love, and perseverance."
    }
  }
}