{
  "title": "Forrest Gump",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A feather floats gently down onto a bench where Forrest sits, symbolizing the whimsy and unpredictability of life.",
      "Theme Stated": "Jenny tells Forrest, 'Life is like a box of chocolates. You never know what you're gonna get,' hinting at the film's exploration of fate and choice.",
      "Set-Up": "We meet Forrest as a child with physical and intellectual challenges, establishing his innocence, simple worldview, and deep love for Jenny.",
      "Catalyst": "Forrest discovers he can run extraordinarily fast, breaking free from his leg braces and symbolizing his unique potential despite obstacles.",
      "Debate": "Forrest grapples with his place in the world, unsure if he can transcend his limitations and what life has in store for him.",
      "Break into Two": "Forrest enlists in the army, stepping into a new world of conflict and growth, marking his journey from innocence to experience.",
      "B Story": "The evolving relationship with Jenny, who represents both his anchor and the complexities of love and loss in his life.",
      "Fun and Games": "Forrest's extraordinary adventures — college football stardom, Vietnam War heroics, ping-pong championships, and entrepreneurial success — highlighting his serendipitous journey through history.",
      "Midpoint": "Forrest learns that Jenny is engaged, confronting him with the reality of their divergent paths and the fragility of his dreams.",
      "Bad Guys Close In": "Jenny's struggles deepen, and Forrest faces emotional pain and confusion, realizing life’s unpredictability and the limits of his innocence.",
      "All Is Lost": "Jenny leaves Forrest again, and he faces loneliness and the harsh truths of adult life, questioning if happiness is within reach.",
      "Dark Night of the Soul": "Forrest reflects on the meaning of life, love, and loss while raising his son alone, embodying resilience in the face of adversity.",
      "Break into Three": "Jenny returns to Forrest, bringing new hope and a chance at forming the family he always wanted.",
      "Finale": "Forrest embraces fatherhood, fulfilling his journey of love and acceptance, showing that life's value lies in connection and perseverance.",
      "Final Image": "The feather from the beginning floats away once more as Forrest watches his son board the school bus, symbolizing the cyclical nature of life and hope for the future."
    },
    "Hero’s Journey": {
      "Ordinary World": "Forrest lives a sheltered childhood in small-town Alabama, limited by his physical and mental challenges but surrounded by love.",
      "Call to Adventure": "His unexpected talent for running propels him into new experiences beyond his familiar world.",
      "Trials": "Forrest faces the Vietnam War, loss of friends, complex relationships, and societal changes, testing his endurance and optimism.",
      "Ordeal": "Confronting Jenny’s departure and later her illness forces Forrest to confront deep emotional pain and the impermanence of life.",
      "Return": "Forrest returns home as a father and a man who has embraced life’s unpredictability, finding peace in love and family."
    },
    "Story Circle": {
      "You": "Forrest, a kind-hearted but intellectually challenged boy, living a simple life in Alabama.",
      "Need": "He seeks love, acceptance, and a sense of purpose beyond his perceived limitations.",
      "Go": "Forrest leaves his childhood behind and ventures into the wider world through running, the army, and various life adventures.",
      "Search": "He navigates the chaos of war, fame, business, and relationships, often stumbling but moving forward with earnestness.",
      "Find": "Forrest discovers his son and reconnects with Jenny, realizing that love and family are his true treasures.",
      "Take": "He embraces the responsibilities of fatherhood and the pain of Jenny's illness, growing emotionally stronger.",
      "Return": "Forrest settles into his role as a devoted father, finding meaning in everyday moments and the legacy he leaves.",
      "Change": "From a boy limited by expectations to a man who shapes his destiny through kindness, resilience, and unconditional love."
    }
  }
}