{
  "title": "GoodFellas",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Young Henry Hill gazes with wide-eyed fascination at the glamorous mafia lifestyle, setting the tone of allure and danger.",
      "Theme Stated": "Tommy warns Henry that if you're in the mafia, you can never really leave — foreshadowing the cost of loyalty and ambition.",
      "Set-Up": "Henry’s childhood introduction to the mob world, building his relationships with Jimmy and Tommy, and his gradual initiation into crime.",
      "Catalyst": "Henry participates in the Lufthansa heist, the biggest robbery in Mafia history, marking the point of no return.",
      "Debate": "Henry struggles with the consequences of his lifestyle—balancing loyalty, greed, and fear as paranoia grows within the crew.",
      "Break into Two": "The aftermath of the heist triggers a series of violent betrayals and murders, plunging Henry deeper into chaos.",
      "B Story": "Henry’s complicated relationship with Karen evolves—her initial attraction to the lifestyle is challenged by its dark realities.",
      "Fun and Games": "The early days of crime—fast cars, parties, and easy money—contrast with the looming threat of law enforcement and mob rivalries.",
      "Midpoint": "Tommy’s brutal murder shakes the crew, signaling the collapse of their power and the beginning of their downfall.",
      "Bad Guys Close In": "The FBI pressure intensifies; paranoia and mistrust fracture the mob family; Henry’s addiction and recklessness escalate.",
      "All Is Lost": "Henry’s arrest and the realization that his friends will not save him — he faces isolation and impending doom.",
      "Dark Night of the Soul": "In jail, Henry contemplates his choices and the price of his ambition as he confronts betrayal and loneliness.",
      "Break into Three": "Henry decides to cooperate with the FBI, choosing self-preservation over loyalty to the mob code.",
      "Finale": "Witness protection removes Henry from his old life; the film depicts his loss of identity and the hollow aftermath of crime.",
      "Final Image": "Henry, now a shadow of his former self, lives anonymously—stripped of glamour, trapped by his past."
    },
    "Hero’s Journey": {
      "Ordinary World": "Henry Hill grows up in Brooklyn, fascinated by the local mobsters and dreaming of belonging.",
      "Call to Adventure": "As a teenager, Henry is invited into the world of organized crime by Jimmy and Tommy.",
      "Trials": "He learns the ropes—performing robberies, running scams, and navigating the dangerous mafia hierarchy.",
      "Ordeal": "The Lufthansa heist and subsequent murders push Henry to the brink, testing his loyalty and survival instincts.",
      "Return": "Facing arrest and betrayal, Henry turns state's witness, leaving behind the life he once craved."
    },
    "Story Circle": {
      "You": "Henry Hill, a young man captivated by the allure of the mafia lifestyle.",
      "Need": "He desires power, respect, and a sense of belonging beyond his humble beginnings.",
      "Go": "Henry immerses himself in crime, building relationships with key mob figures and escalating his criminal activities.",
      "Search": "He navigates the thrills and dangers of the underworld, seeking success while confronting moral compromises.",
      "Find": "After the Lufthansa heist, Henry discovers that the violent realities of the mob world threaten everything he values.",
      "Take": "Confronted by betrayal, law enforcement, and addiction, Henry chooses to betray the mob to save himself.",
      "Return": "He enters witness protection, leaving behind his former identity and lifestyle.",
      "Change": "Stripped of glamour and power, Henry faces a painful reckoning with the cost of his choices and lost innocence."
    }
  }
}