{
  "title": "Grave of the Fireflies",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Seita and Setsuko, two siblings, are introduced amidst the ruins of wartime Japan, highlighting innocence overshadowed by devastation.",
      "Theme Stated": "The fragility of life and the cost of war become clear as Setsuko’s simple joys contrast with the harsh reality surrounding them.",
      "Set-Up": "Seita and Setsuko lose their home and mother in the firebombing of Kobe, setting their struggle for survival into motion.",
      "Catalyst": "Their father is absent, serving in the navy, and the siblings are forced to fend for themselves after being rejected by distant relatives.",
      "Debate": "Seita wrestles with pride and desperation, debating whether to accept charity or maintain independence despite dwindling resources.",
      "Break into Two": "Seita takes Setsuko to an abandoned bomb shelter, deciding to survive alone away from society’s judgment and constraints.",
      "B Story": "The brother-sister bond deepens, showcasing their mutual love and innocence amid despair, adding emotional weight to the narrative.",
      "Fun and Games": "Moments of childlike wonder and hope emerge as Setsuko collects fireflies, providing fleeting light in their dark world.",
      "Midpoint": "Hope turns to crisis as food shortages and illness start to claim their strength, marking a shift from hopeful survival to tragic decline.",
      "Bad Guys Close In": "Hunger, disease, and isolation tighten their grip, while societal indifference and Seita’s pride exacerbate their suffering.",
      "All Is Lost": "Setsuko’s health deteriorates rapidly, and Seita's inability to protect his sister culminates in devastating loss.",
      "Dark Night of the Soul": "Seita confronts the crushing reality of his failure and the merciless consequences of war on innocent lives.",
      "Break into Three": "In a final act of desperation, Seita seeks help but finds no solace, symbolizing the ultimate collapse of hope.",
      "Finale": "Setsuko dies, and Seita succumbs to starvation, their tragic end underscoring the inhumanity of war and societal neglect.",
      "Final Image": "Seita’s ghost reunites with Setsuko amid fireflies, a poignant reminder of innocence lost and the enduring bond beyond death."
    },
    "Hero’s Journey": {
      "Ordinary World": "Seita and Setsuko live peacefully with their mother during WWII in Kobe, Japan.",
      "Call to Adventure": "The bombing destroys their home and kills their mother, thrusting them into survival mode.",
      "Trials": "The siblings face hunger, illness, social alienation, and the harsh realities of war-torn Japan.",
      "Ordeal": "Despite Seita’s efforts, Setsuko’s health fails, and she dies from malnutrition and disease.",
      "Return": "Seita dies alone in a train station, his spirit reunited with Setsuko, highlighting the tragic cost of war on the innocent."
    },
    "Story Circle": {
      "You": "Seita, a young boy, lives a normal life with his sister Setsuko.",
      "Need": "After their home is destroyed and mother dies, they need to survive on their own.",
      "Go": "Seita chooses to take Setsuko away from relatives to live independently in an abandoned shelter.",
      "Search": "They struggle to find food, warmth, and safety amid the devastation around them.",
      "Find": "They briefly find happiness and light through moments like catching fireflies and caring for each other.",
      "Take": "The harsh realities of starvation and illness take their toll, threatening their very existence.",
      "Return": "Seita faces the loss of Setsuko and eventually dies, his spirit returning to the world of the living as a ghost.",
      "Change": "The story reveals the devastating human cost of war, innocence lost, and the enduring bond of family beyond life and death."
    }
  }
}