{
  "title": "Interstellar",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A dusty, dying Earth plagued by environmental collapse, introducing Cooper as a farmer and former pilot struggling to provide for his family.",
      "Theme Stated": "Murph tells Cooper, 'No one’s coming back from this,' hinting at the deep human desire to survive and the cost of exploration.",
      "Set-Up": "Cooper’s family life is established, including his strained relationship with his daughter Murph, the school system's limitations, and the mysterious gravitational anomalies in their house.",
      "Catalyst": "Cooper discovers a secret NASA facility led by Professor Brand, who reveals the plan to save humanity by finding a new habitable planet beyond the galaxy.",
      "Debate": "Cooper wrestles with leaving his family behind to join the space mission, questioning whether he can trust the plan and if he’s abandoning his children.",
      "Break into Two": "Cooper commits to the space mission, leaving Earth and the life he knows to venture into the unknown cosmos.",
      "B Story": "Murph’s journey on Earth, grappling with feelings of abandonment and trying to solve the gravitational equation that will save humanity.",
      "Fun and Games": "The thrilling exploration of wormholes, alien worlds, and the wonder and danger of space travel; the crew faces both awe-inspiring and perilous environments.",
      "Midpoint": "The revelation that Professor Brand has lied about the feasibility of Plan A, and that Plan B—colonizing a new planet with embryos—may be the only hope, heightening stakes and emotional conflict.",
      "Bad Guys Close In": "Time dilation, resource depletion, and internal tension escalate; the crew suffers losses, including Dr. Mann’s betrayal, which threatens the mission and their survival.",
      "All Is Lost": "Cooper and Brand are stranded after Dr. Mann’s catastrophic sabotage, and it seems the mission—and humanity’s hope—is doomed.",
      "Dark Night of the Soul": "Alone and isolated, Cooper confronts despair, the weight of sacrifice, and the seeming futility of their quest as Murph back on Earth struggles with her own doubts.",
      "Break into Three": "Cooper decides to sacrifice himself by entering the black hole to send critical quantum data back to Murph, reigniting hope for humanity’s survival.",
      "Finale": "Inside the tesseract, Cooper transcends time and space to communicate with young Murph, enabling her to solve the equation; Cooper is rescued and reunites with an older Murph before setting off to find Brand on the distant planet.",
      "Final Image": "Cooper, renewed and hopeful, piloting a spacecraft toward Brand, symbolizing humanity’s enduring spirit and the endless quest for connection and survival."
    },
    "Hero’s Journey": {
      "Ordinary World": "Cooper’s life as a struggling farmer on a dying Earth, raising his children and nostalgic for his pilot days.",
      "Call to Adventure": "The discovery of NASA’s secret mission to find a new home for humanity beyond the stars.",
      "Trials": "Navigating the wormhole, surviving the hostile planets, confronting betrayal, and coping with time’s relentless passage.",
      "Ordeal": "Entering the black hole, facing the unknown, and risking everything to obtain the data necessary to save humanity.",
      "Return": "Cooper returns through the tesseract to communicate with Murph, then reunites with her in the future before embarking on a new journey to find Brand."
    },
    "Story Circle": {
      "You": "Cooper, a former pilot turned farmer, living a constrained life on a dying Earth.",
      "Need": "To save his children and humanity by finding a new habitable planet beyond the stars.",
      "Go": "He leaves Earth, joining a perilous mission through a wormhole to explore distant worlds.",
      "Search": "He confronts physical dangers, time dilation, and moral dilemmas while exploring unknown planets and facing betrayal.",
      "Find": "He discovers the truth about the mission’s deception and the necessity of Plan B, as well as the key to saving humanity hidden in the black hole’s data.",
      "Take": "He sacrifices himself by entering the black hole, risking his life to send vital information to Murph across time.",
      "Return": "Cooper’s message enables Murph to solve the gravitational equation and save humanity; he is rescued and reunited with her years later.",
      "Change": "Cooper evolves from a reluctant father and pilot to a selfless hero embracing sacrifice, hope, and the power of love transcending time and space."
    }
  }
}