{
  "title": "Parasite",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "The Kim family’s cramped semi-basement apartment, highlighting their poverty and struggle to survive in modern Seoul.",
      "Theme Stated": "Ki-woo’s sister, Ki-jung, remarks on the stark divide between social classes, hinting at the central theme of inequality and deception.",
      "Set-Up": "The Kim family schemes to infiltrate the wealthy Park household by securing jobs as tutors and servants, showcasing their resourcefulness and desperation.",
      "Catalyst": "Ki-woo receives the opportunity to tutor the Park’s daughter, opening the door to a new social world and beginning their infiltration.",
      "Debate": "The Kims wrestle with the morality and risks of their deceit, questioning how far they can go without being exposed.",
      "Break into Two": "The family systematically replaces the existing Park staff, embedding themselves deeper into the household and their luxurious lifestyle.",
      "B Story": "The relationship between Ki-woo and Da-hye, the Park daughter, symbolizes the bridge and the gap between the two worlds.",
      "Fun and Games": "The Kims enjoy their new roles, indulging in the luxuries of the Park home and reveling in their temporary escape from poverty.",
      "Midpoint": "Discovery of the hidden basement bunker and the former housekeeper’s husband living there shifts the story from light deception to dark suspense.",
      "Bad Guys Close In": "The Kims’ precarious secret unravels as the underground dweller threatens their position and the Parks’ world becomes increasingly unstable.",
      "All Is Lost": "The revelation of the hidden man leads to a violent confrontation, shattering the fragile balance and exposing the Kims’ deception.",
      "Dark Night of the Soul": "Ki-taek, the father, grapples with his powerless status and the unbearable injustice of their situation as tensions escalate.",
      "Break into Three": "During a lavish birthday party, suppressed class resentments explode, and Ki-taek makes a decisive, tragic choice that seals their fate.",
      "Finale": "Chaos erupts at the Park house—violence, tragedy, and the ultimate collapse of the Kim family’s plan, revealing the brutal costs of social inequality.",
      "Final Image": "Ki-woo, now separated from his family, gazes at the Park mansion from afar, dreaming of a day he might afford to buy it, embodying both hope and despair."
    },
    "Hero’s Journey": {
      "Ordinary World": "The Kim family lives in poverty in a semi-basement apartment, struggling to get by with low-paying, unstable jobs.",
      "Call to Adventure": "Ki-woo is offered a chance to tutor the daughter of the wealthy Park family, presenting an opportunity for a better life.",
      "Trials": "The family must cleverly manipulate and deceive to embed themselves within the Park household, replacing existing staff and maintaining their facade.",
      "Ordeal": "The discovery of the secret bunker and the man living there threatens to unravel everything, forcing the Kims into a dangerous confrontation.",
      "Return": "After the violent climax, Ki-woo reflects from a distance on his fractured family and the social divide, holding onto a fragile hope for change."
    },
    "Story Circle": {
      "You": "The Kim family, struggling in poverty, seeking a way out of their desperate circumstances.",
      "Need": "They need financial stability and social mobility to escape their cycle of hardship and humiliation.",
      "Go": "Ki-woo accepts the tutoring job, initiating the family's infiltration of the Park household.",
      "Search": "The Kims work to embed themselves deeper into the Parks’ lives, navigating the challenges of deception and class barriers.",
      "Find": "They uncover the hidden bunker and the man living there, revealing the dark underbelly of the Park family’s world and the limits of their control.",
      "Take": "The family faces violent consequences as their secret is exposed, culminating in a chaotic and tragic climax at a birthday party.",
      "Return": "Ki-woo returns to the margins of society, physically removed but emotionally tied to the Park home and the dream of a better life.",
      "Change": "He is forced to confront the brutal realities of class division, understanding that true escape requires more than cunning—it demands sacrifice and hope."
    }
  }
}