{
  "title": "Pulp Fiction",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Two small-time criminals, Pumpkin and Honey Bunny, sit in a diner, contemplating a robbery — setting a raw, unpredictable tone.",
      "Theme Stated": "Jules philosophizes about fate and redemption, hinting that choices define who we become.",
      "Set-Up": "Vincent and Jules execute a robbery, establishing their dynamic, the violent yet philosophical world they inhabit, and the stakes of their criminal lives.",
      "Catalyst": "Jules and Vincent narrowly escape a deadly shootout, forcing Jules to question his life’s path.",
      "Debate": "Jules wrestles with his desire to leave the violent life behind, while Vincent remains indifferent; Mia's introduction complicates Vincent’s narrative.",
      "Break into Two": "Vincent agrees to take Mia out, crossing into a new chapter of temptation and risk.",
      "B Story": "The relationship between Butch and Fabienne begins, representing love amid chaos and a contrasting storyline of honor and survival.",
      "Fun and Games": "Iconic scenes unfold — the dance contest, the heroin overdose, the tense pawnshop rescue — blending dark humor with high stakes.",
      "Midpoint": "Butch kills a rival boxer and breaks his deal, turning his story into a desperate escape, while Jules experiences a spiritual awakening.",
      "Bad Guys Close In": "The pawnshop captors threaten Butch and Marsellus, escalating tension and danger; Vincent's careless behavior sets him up for disaster.",
      "All Is Lost": "Vincent is unexpectedly killed by Butch, shattering the perceived invincibility of the characters.",
      "Dark Night of the Soul": "Jules confronts the randomness of violence and chooses to seek a new, peaceful path; Butch faces his own moral crossroads.",
      "Break into Three": "Jules decides to walk away from crime, seeking redemption; Butch returns to save Marsellus, forming an uneasy alliance.",
      "Finale": "Jules diffuses the diner robbery with calm authority, embodying his transformation; Butch escapes with Fabienne, embracing a chance at a new life.",
      "Final Image": "Jules leaves the diner, a man transformed, while the city continues its chaotic pulse — a brutal world where change is possible but uncertain."
    },
    "Hero’s Journey": {
      "Ordinary World": "Vincent and Jules navigate the gritty criminal underworld of Los Angeles, bound by loyalty and violence.",
      "Call to Adventure": "After surviving a near-death experience, Jules feels compelled to change his path and seek meaning beyond crime.",
      "Trials": "Vincent faces temptation with Mia, Butch defies his bosses by double-crossing them, and both confront life-threatening challenges.",
      "Ordeal": "In the pawnshop basement, Butch and Marsellus endure brutal captivity, forcing an alliance and testing their wills.",
      "Return": "Jules returns to the diner, embodying his new philosophy, disarming a dangerous situation with calm and clarity, symbolizing his rebirth."
    },
    "Story Circle": {
      "You": "Vincent and Jules are hardened hitmen entrenched in a violent, unpredictable world.",
      "Need": "Jules seeks redemption and a way out; Vincent needs to maintain control in an increasingly chaotic life.",
      "Go": "Jules decides to retire from crime; Vincent pursues a night out with Mia, leading to unforeseen consequences.",
      "Search": "Both navigate temptations and dangers — Vincent with Mia, Butch with his betrayal and escape plan.",
      "Find": "Butch discovers his own courage and agency; Jules finds spiritual insight and resolve.",
      "Take": "Butch rescues Marsellus, risking his life; Jules confronts and diffuses a diner robbery, asserting his new values.",
      "Return": "Jules leaves the criminal life behind, walking away from the diner; Butch escapes the city with Fabienne, seeking freedom.",
      "Change": "Jules transforms from cold hitman to enlightened man; Butch embraces personal honor over survival alone, signaling hope amid chaos."
    }
  }
}