{
  "title": "Seven Samurai",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A poor, desperate farming village plagued by ruthless bandits, highlighting vulnerability and despair.",
      "Theme Stated": "The village elder suggests that only samurai can save them, introducing the theme of honor and sacrifice versus survival.",
      "Set-Up": "Villagers decide to hire samurai for protection; they send two men to recruit warriors, showing desperation and hope.",
      "Catalyst": "Kambei, a wise and honorable ronin, accepts the mission to protect the village, setting the story in motion.",
      "Debate": "Kambei and the villagers grapple with recruiting enough skilled samurai and whether their plan will succeed.",
      "Break into Two": "The seven samurai are assembled, and they move to the village to begin preparations, shifting from planning to action.",
      "B Story": "The growing relationships between samurai and villagers, especially the bond between Katsushiro and the village girl, reflect personal stakes and human connection.",
      "Fun and Games": "Training the villagers, fortifying defenses, and preparing for the inevitable battle showcase camaraderie and rising hope.",
      "Midpoint": "The first bandit raid is repelled, a temporary victory that raises stakes and confidence for both samurai and villagers.",
      "Bad Guys Close In": "Bandits regroup and intensify their attacks, testing the defenses and resolve of the defenders.",
      "All Is Lost": "A surprise attack results in casualties among the villagers and samurai, shattering morale and hope.",
      "Dark Night of the Soul": "Kambei and his comrades question their chances as the bandits prepare for a final, overwhelming assault.",
      "Break into Three": "The samurai rally the villagers for a last stand, reaffirming their commitment to sacrifice and protection.",
      "Finale": "A brutal, strategic battle unfolds; the samurai and villagers fight with courage, losses mount, but they ultimately defeat the bandits.",
      "Final Image": "The village is saved but scarred; the surviving samurai depart quietly, underscoring that the true victory belongs to the villagers."
    },
    "Hero’s Journey": {
      "Ordinary World": "The farming village lives in fear and poverty, vulnerable to bandit raids.",
      "Call to Adventure": "The villagers seek out samurai to defend them, appealing to Kambei to take on the mission.",
      "Trials": "Kambei recruits six other samurai, and together they train villagers and prepare defenses, facing skepticism and danger.",
      "Ordeal": "The climactic battle against the bandits tests the samurai’s skills, resolve, and willingness to sacrifice.",
      "Return": "With the bandits defeated, the surviving samurai leave the village, their mission complete but their place forever changed."
    },
    "Story Circle": {
      "You": "The samurai, especially Kambei, embody honor and skill but live a rootless, wandering life.",
      "Need": "They need purpose and a cause worthy of their sacrifice.",
      "Go": "They accept the villagers' plea and journey to the threatened village.",
      "Search": "They train the villagers, strategize defenses, and face internal doubts and external threats.",
      "Find": "They discover strength in unity and the villagers' resilience.",
      "Take": "They confront the bandits in a brutal battle, enduring loss and hardship.",
      "Return": "After victory, the samurai leave the village, their task fulfilled.",
      "Change": "The samurai find meaning beyond themselves, while the villagers gain hope and protection; sacrifice leads to renewal."
    }
  }
}