{
  "title": "Seven Samurai",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A poor farming village struggles under the constant threat of ruthless bandits, highlighting their vulnerability and despair.",
      "Theme Stated": "The villagers express their hopelessness, hinting at the theme that unity and courage can overcome oppression.",
      "Set-Up": "We meet the villagers’ daily hardships and their decision to seek help, setting the stakes and introducing key characters.",
      "Catalyst": "The villagers decide to hire samurai to protect them, initiating the quest for defenders.",
      "Debate": "The farmers grapple with how to find samurai willing to risk their lives for little pay, reflecting their desperation and doubts.",
      "Break into Two": "Kambei, the experienced ronin, agrees to help, marking the transition into active preparation for defense.",
      "B Story": "The relationships between samurai and villagers deepen, exploring themes of honor, class, and mutual respect.",
      "Fun and Games": "Recruitment of the samurai team, training the villagers, and building defenses showcase camaraderie and strategy.",
      "Midpoint": "The bandits attack prematurely, testing the villagers’ and samurai’s readiness; a moment of victory and loss that raises the stakes.",
      "Bad Guys Close In": "The bandits regroup and launch a full-scale assault, overwhelming the village and threatening total destruction.",
      "All Is Lost": "The villagers' defenses falter, and key samurai are killed, creating a sense of imminent defeat.",
      "Dark Night of the Soul": "Survivors mourn and question whether their sacrifice was in vain, confronting despair and fear.",
      "Break into Three": "A final resolve emerges among the remaining samurai and villagers to make a last stand, embracing unity and hope.",
      "Finale": "In a fierce, strategic battle, the samurai and villagers fight with everything they have, ultimately repelling the bandits.",
      "Final Image": "The once-threatened village stands scarred but free, highlighting themes of sacrifice and rebirth."
    },
    "Hero’s Journey": {
      "Ordinary World": "The villagers live in fear, farming under the constant threat of bandit raids, trapped in a cycle of poverty and helplessness.",
      "Call to Adventure": "The farmers decide to seek samurai protectors, inviting outsiders to change their fate.",
      "Trials": "Kambei and his recruited samurai face challenges recruiting allies, training villagers, and preparing defenses.",
      "Ordeal": "The climactic battle tests the courage, skill, and resolve of the samurai and villagers alike, pushing them to their limits.",
      "Return": "After victory, the surviving samurai reflect on their sacrifices, and the village begins to rebuild, forever changed."
    },
    "Story Circle": {
      "You": "The poor villagers, vulnerable and besieged, longing for safety and peace.",
      "Need": "They need protection from the bandits who threaten their survival.",
      "Go": "They seek out samurai willing to defend them, stepping into unfamiliar territory.",
      "Search": "The samurai recruit allies, train villagers, and prepare defenses, facing internal and external challenges.",
      "Find": "They confront the bandits in battle, finding strength in unity and strategy.",
      "Take": "They endure losses and sacrifices, fighting desperately to save the village.",
      "Return": "The survivors emerge from battle, forever changed by their ordeal and sacrifice.",
      "Change": "The village gains freedom and hope, while the samurai acknowledge the cost of honor and duty."
    }
  }
}