{
  "title": "Spider-Man: Into the Spider-Verse",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Miles Morales navigates life between two worlds — his elite boarding school and his Brooklyn roots. He's bright, creative, and disconnected, setting the stage for a coming-of-age transformation.",
      "Theme Stated": "Peter Parker’s voiceover and Miles’ graffiti art reflect the core message: 'Anyone can wear the mask.' This is a story about identity, responsibility, and finding one’s place.",
      "Set-Up": "Miles’ relationship with his father and uncle is established, highlighting different influences. A mysterious spider bite begins to alter his perception — and his DNA.",
      "Catalyst": "Miles witnesses Peter Parker’s death and is entrusted with a device that can stop Kingpin's collider. The world loses a hero — and Miles inherits a burden he doesn’t feel ready for.",
      "Debate": "Haunted by doubt, Miles questions his worth. He meets alternate Spider-heroes who challenge and inspire him, but also doubt his readiness.",
      "Break into Two": "Despite fear and inexperience, Miles joins the mission. He must train with Peter B. Parker and learn what it means to become Spider-Man.",
      "B Story": "Peter B. Parker acts as an unlikely mentor. Their dynamic — gruff veteran and wide-eyed rookie — evolves into mutual growth and emotional resonance.",
      "Fun and Games": "Training montages, stealth missions, awkward webslinging, and humorous multiverse hijinks build the world’s tone and Miles’ internal struggle.",
      "Midpoint": "After being tied up by his friends for his own safety, Miles has a breakthrough. He internalizes the belief that he must take control of his fate — alone.",
      "Bad Guys Close In": "Kingpin’s plan accelerates. The collider threatens to destroy all dimensions. Miles’ confidence is tested as his family becomes a target.",
      "All Is Lost": "His uncle Aaron — revealed as the Prowler — is killed protecting him. Miles is left grieving, feeling unready, abandoned by the other Spider-heroes.",
      "Dark Night of the Soul": "With advice from his father and memory of his uncle, Miles reflects on what makes a hero. He realizes that self-belief is the missing piece.",
      "Break into Three": "Miles designs his own suit, masters his powers, and joins the final mission. He steps into the Spider-Man identity with clarity and style.",
      "Finale": "Miles defeats Kingpin with ingenuity and heart. He helps the others return home and protects his city — on his own terms.",
      "Final Image": "Miles swings confidently through Brooklyn, embracing his identity. He’s no longer in Peter’s shadow — he’s his own Spider-Man."
    },
    "Hero’s Journey": {
      "Ordinary World": "Miles is a gifted teen struggling to fit into his new school and balance expectations from his family.",
      "Call to Adventure": "After being bitten by a radioactive spider and witnessing Spider-Man’s death, Miles inherits a cosmic responsibility.",
      "Trials": "He trains with alternate Spider-heroes, confronts villains, and grapples with loss and fear. Each challenge pushes him closer to self-realization.",
      "Ordeal": "Miles is forced to face his greatest fear — that he isn’t ready. But through introspection and support, he claims his power.",
      "Return": "He emerges as a confident, capable Spider-Man, ready to protect his world and carry the legacy forward."
    },
    "Story Circle": {
      "You": "Miles is a bright, self-doubting teen caught between expectation and self-expression.",
      "Need": "He yearns to live up to the Spider-Man legacy, but needs to believe in himself and embrace his own version of heroism.",
      "Go": "After a spider bite and witnessing Peter Parker’s death, he’s pulled into a multiverse mission with alternate Spider-heroes.",
      "Search": "He trains awkwardly, faces skepticism, and struggles to control his powers while navigating grief and pressure.",
      "Find": "Through personal loss and hard-earned insight, he discovers his strength and what makes him unique.",
      "Take": "He loses his uncle and is rejected by the team, forcing him to stand alone and confront his deepest fears.",
      "Return": "Miles creates his own suit, refines his abilities, and joins the final battle with full confidence.",
      "Change": "He emerges as a true Spider-Man — grounded in self-belief, compassion, and a distinct sense of identity."
    }
  }
}
