{
  "title": "Spirited Away",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Chihiro and her parents drive toward their new home, an uneasy and restless mood permeates as she resists the unknown change ahead.",
      "Theme Stated": "Chihiro’s mother warns her to be brave and adaptable, hinting at the necessity of courage and growth in the face of change.",
      "Set-Up": "The family stumbles upon an abandoned theme park; Chihiro’s fear and reluctance to explore the strange world are established, as her parents indulge greedily in the food.",
      "Catalyst": "Chihiro’s parents are transformed into pigs after eating the enchanted food, thrusting her into a perilous supernatural world alone.",
      "Debate": "Chihiro confronts her fear and confusion, questioning how she can survive and rescue her parents from this bizarre, threatening realm.",
      "Break into Two": "She accepts a job at the bathhouse, committing to navigate and adapt to the spirit world’s rules and challenges.",
      "B Story": "The friendship and trust-building with Haku, a mysterious boy who guides and protects her, representing hope and alliance in adversity.",
      "Fun and Games": "Chihiro encounters a series of magical creatures, strange rituals, and odd jobs, learning the customs of the bathhouse and growing in confidence.",
      "Midpoint": "Chihiro learns Haku’s true identity and realizes the deeper dangers at play, raising the stakes emotionally and narratively.",
      "Bad Guys Close In": "Yubaba tightens control; Chihiro faces betrayal, grueling labor, and the loss of her identity, as the spiritual world’s pressure mounts.",
      "All Is Lost": "Haku is gravely injured after stealing a magical seal; Chihiro feels overwhelmed by the darkness around her and the seeming impossibility of escape.",
      "Dark Night of the Soul": "In a moment of quiet desperation, Chihiro reflects on her journey, understanding that courage, love, and self-belief are essential to breaking free.",
      "Break into Three": "Chihiro resolves to confront Yubaba directly, using her newfound strength and wit to save Haku and her parents.",
      "Finale": "Through cleverness, compassion, and bravery, Chihiro completes the tests, breaks the spell on her parents, and restores balance, bidding farewell to the spirit world.",
      "Final Image": "Chihiro, transformed and mature, confidently crosses the bridge back to the human world, symbolizing her emotional growth and readiness for the future."
    },
    "Hero’s Journey": {
      "Ordinary World": "Chihiro is a scared, sulky girl moving to a new home, feeling out of place and resistant to change.",
      "Call to Adventure": "Her family’s detour into the abandoned theme park and the discovery of the magical bathhouse world.",
      "Trials": "Facing strange spirits, hard labor, and learning the rules of the bathhouse, including working under Yubaba’s oppressive regime.",
      "Ordeal": "The near loss of Haku and the personal test of courage when Chihiro must save him and confront Yubaba’s power directly.",
      "Return": "Chihiro succeeds in freeing her parents and escaping the spirit world, returning to the human world with newfound maturity and self-assurance."
    },
    "Story Circle": {
      "You": "Chihiro, a fearful and uncertain girl entering a new phase in life.",
      "Need": "She needs to survive and find a way to save her parents and herself from the spirit world’s dangers.",
      "Go": "Chihiro steps into the bathhouse, embracing the unknown despite her fear.",
      "Search": "She navigates complex social and magical challenges, learning about trust, identity, and resilience.",
      "Find": "Chihiro discovers courage within herself and the true identity of Haku, gaining allies and knowledge.",
      "Take": "She takes responsibility, facing down Yubaba and the risks involved to free her parents and friends.",
      "Return": "Chihiro returns to the human world, crossing back from the spirit realm changed and empowered.",
      "Change": "She emerges confident, brave, and self-reliant, transformed by her journey and ready for the challenges ahead."
    }
  }
}