{
  "title": "The Godfather",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A dimly lit office where Don Vito Corleone listens to a desperate plea on the day of his daughter's wedding — a world of power, loyalty, and tradition.",
      "Theme Stated": "Don Corleone’s assertion that 'a man who doesn’t spend time with his family can never be a real man' hints at the tension between family loyalty and the violent Mafia world.",
      "Set-Up": "We meet the Corleone family and their sphere of influence, establishing Michael as the outsider who wants to live a clean life away from crime.",
      "Catalyst": "The attempted assassination of Don Vito Corleone shatters the family's stability and forces Michael into the violent world he wanted to avoid.",
      "Debate": "Michael struggles with whether to protect his family through violence or stay disconnected, wrestling with his identity and values.",
      "Break into Two": "Michael commits to action by killing Sollozzo and McCluskey, stepping fully into the Mafia life and its dangerous underworld.",
      "B Story": "Michael’s evolving relationship with Kay Adams highlights his internal conflict between love, normalcy, and the darkness enveloping him.",
      "Fun and Games": "The Corleone family fights back against rival gangs, showcasing strategic power plays, tense negotiations, and the brutal reality of Mafia warfare.",
      "Midpoint": "The death of Sonny, Michael’s hot-headed brother, marks a devastating loss and a turning point in the family’s fortunes and Michael’s resolve.",
      "Bad Guys Close In": "Rival families close in, and Michael flees to Sicily, isolated and vulnerable, as enemies threaten both his life and family legacy.",
      "All Is Lost": "The murder of Michael’s Sicilian wife and the ongoing threats at home leave Michael emotionally shattered and seemingly powerless.",
      "Dark Night of the Soul": "Michael reflects on the cost of power, family, and revenge, confronting the man he has become versus the man he wanted to be.",
      "Break into Three": "Returning to New York, Michael prepares to reclaim control with calculated ruthlessness, ready to end the war decisively.",
      "Finale": "Michael orchestrates the elimination of all his enemies in a chilling sequence of betrayals, cementing his role as the new Don Corleone.",
      "Final Image": "Michael sits alone in his father’s office, cold and authoritative, as Kay watches him realize he has fully embraced the dark legacy he once resisted."
    },
    "Hero’s Journey": {
      "Ordinary World": "Michael Corleone lives apart from his family’s criminal dealings, a decorated war hero with hopes of a legitimate future.",
      "Call to Adventure": "The attack on Don Vito disrupts their lives and calls Michael to intervene to protect his family.",
      "Trials": "Michael navigates dangerous alliances, executes murders, and survives exile in Sicily, testing his resolve and morality.",
      "Ordeal": "The loss of his brother Sonny and his wife in Sicily forces Michael to confront profound grief and the brutal realities of his world.",
      "Return": "Michael returns home transformed, taking his father’s place as Don and embracing the mantle of leadership with cold resolve."
    },
    "Story Circle": {
      "You": "Michael, a reluctant outsider to his family's criminal empire, craving a peaceful, honorable life.",
      "Need": "To protect his family and legacy after the Don is nearly killed, confronting the violent world he rejected.",
      "Go": "Michael commits to violent action, assassinating key enemies and going into hiding in Sicily.",
      "Search": "He faces exile, loss, and betrayal, searching for a way to safeguard his family’s future amidst chaos.",
      "Find": "Michael discovers the true cost of power and sacrifice, realizing he must embrace the darkness to survive.",
      "Take": "He returns to New York and ruthlessly eliminates his rivals, seizing control of the Corleone family.",
      "Return": "Now the new Don, Michael integrates fully into the criminal world he once avoided.",
      "Change": "From idealistic war hero to cold, calculating Mafia boss, Michael’s transformation seals his fate and distances him from his former self and loved ones."
    }
  }
}