{
  "title": "The Lord of the Rings: The Return of the King",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A sweeping view of Middle-earth, showing the fragile peace and the looming threat of darkness, setting the stage for the final confrontation.",
      "Theme Stated": "Frodo and Sam express the burdens of their quest, hinting at sacrifice and hope — the idea that even the smallest person can change the course of the future.",
      "Set-Up": "The Fellowship is fractured; Aragorn embraces his destiny as the true king, while Frodo and Sam continue their perilous journey to Mount Doom. The world braces for war.",
      "Catalyst": "Gandalf receives the ominous news of Sauron's army mobilizing; the urgency to unite forces and distract Sauron so Frodo can destroy the Ring becomes paramount.",
      "Debate": "Aragorn wrestles with self-doubt and the weight of leadership; Frodo struggles with the Ring’s corrupting power, questioning if their mission can succeed.",
      "Break into Two": "Aragorn chooses to claim his heritage and lead the armies of men to the Black Gate, committing to a desperate gambit that will give Frodo a chance.",
      "B Story": "Sam's unwavering loyalty and friendship become the emotional heart, showcasing the power of hope and resilience amid despair.",
      "Fun and Games": "Epic battles unfold — the Siege of Minas Tirith, the charge of the Rohirrim, and the clash at the Black Gate — showcasing heroism, sacrifice, and camaraderie.",
      "Midpoint": "The Battle of Pelennor Fields reaches its climax with the arrival of Aragorn and the Army of the Dead, turning the tide and reigniting hope.",
      "Bad Guys Close In": "Frodo is captured by Orcs in Cirith Ungol; Sauron's forces advance relentlessly, and the Ring’s influence tightens its grip on Frodo.",
      "All Is Lost": "Sam rescues Frodo from the Tower of Cirith Ungol, but Frodo is weakened and nearly succumbs to the Ring’s power; the fate of Middle-earth seems bleak.",
      "Dark Night of the Soul": "On the slopes of Mount Doom, Frodo is overwhelmed by the Ring, claiming it for himself; the mission appears doomed as darkness threatens to win.",
      "Break into Three": "Gollum’s intervention, though violent and unforeseen, leads to the Ring’s destruction, fulfilling the quest in a moment of chaotic salvation.",
      "Finale": "The Ring’s destruction triggers Sauron's downfall; peace returns as Aragorn is crowned king, friendships are honored, and sacrifices are remembered.",
      "Final Image": "Frodo and his companions sail into the West, carrying the emotional weight of their journey — a bittersweet farewell signaling the end of an era."
    },
    "Hero’s Journey": {
      "Ordinary World": "Middle-earth is in turmoil; the Fellowship is broken, and the shadow of Sauron darkens the land, but hope still flickers in the hearts of a few.",
      "Call to Adventure": "Frodo and Sam continue their perilous trek to Mount Doom to destroy the One Ring, while Aragorn steps toward his destiny as the King of Gondor.",
      "Trials": "Battles rage, friendships are tested, and inner demons surface — Frodo faces the Ring’s seductive power, Sam’s loyalty shines, and Aragorn embraces his leadership.",
      "Ordeal": "At Mount Doom, Frodo succumbs to the Ring, but through Gollum’s intervention, the Ring is destroyed, and Sauron's power is broken, averting total darkness.",
      "Return": "Peace is restored; Aragorn is crowned king, the hobbits return to the Shire changed forever, and Frodo departs Middle-earth to find healing, symbolizing the end of a long journey."
    },
    "Story Circle": {
      "You": "Frodo and the Fellowship, living in a world threatened by evil, bound by duty and friendship.",
      "Need": "They must destroy the One Ring to save Middle-earth from Sauron's domination.",
      "Go": "Frodo and Sam venture into Mordor; Aragorn rallies the armies to draw Sauron's gaze away.",
      "Search": "They face physical battles, inner turmoil, and dark temptations; friendships are tested, and hope wavers.",
      "Find": "Despite overwhelming odds, the Ring is destroyed through unexpected sacrifice and intervention.",
      "Take": "They pay a high price — Frodo is forever changed, and the victory is bittersweet with loss and sorrow.",
      "Return": "The survivors return home; Aragorn claims his throne, and the hobbits come back to the Shire, but nothing is quite the same.",
      "Change": "They have grown through sacrifice and resilience; the world is saved, but personal scars remain, symbolizing the cost of heroism."
    }
  }
}