{
  "title": "The Green Mile",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Paul Edgecomb, an elderly man in a nursing home, begins recounting his time as a death row corrections officer during the 1930s.",
      "Theme Stated": "The nature of justice, mercy, and the miraculous power of empathy is introduced through Paul's reflections and the arrival of John Coffey.",
      "Set-Up": "Paul and his team work on death row, called 'The Green Mile,' establishing the harsh realities of the prison and the prisoners' humanity.",
      "Catalyst": "John Coffey, a physically imposing but gentle man convicted of a terrible crime, arrives on death row, sparking curiosity and unease.",
      "Debate": "Paul and the guards wrestle with their initial judgments of Coffey, questioning his guilt and the justice system's infallibility.",
      "Break into Two": "Paul discovers Coffey’s miraculous healing abilities, shifting the story from a procedural drama to a supernatural and moral journey.",
      "B Story": "The relationship between Paul and Coffey deepens, highlighting themes of redemption, innocence, and the human capacity for good amidst cruelty.",
      "Fun and Games": "Coffey performs miracles, healing Paul’s urinary infection and resurrecting Mr. Jingles, the mouse, creating moments of wonder and hope on death row.",
      "Midpoint": "The revelation that Coffey is innocent and that the real murderer, Percy Wetmore, has been abusing his power flips the stakes and intensifies the moral dilemma.",
      "Bad Guys Close In": "Percy’s cruelty escalates; the guards face increased tension and danger, and the weight of impending executions looms heavier.",
      "All Is Lost": "Despite knowing the truth, the system's machinery moves forward; Coffey accepts his fate, embodying tragic innocence and sacrifice.",
      "Dark Night of the Soul": "Paul grapples with helplessness and guilt, questioning the fairness of justice and his role in the inevitable execution.",
      "Break into Three": "Paul and the guards resolve to honor Coffey’s dignity, preparing emotionally and physically for the final journey down the Green Mile.",
      "Finale": "Coffey is executed, but not before bestowing a final gift of healing and peace; Paul is left to carry the burden of Coffey’s legacy.",
      "Final Image": "An aged Paul reflects on the cost of mercy and the enduring impact of one miraculous man who changed his life forever."
    },
    "Hero’s Journey": {
      "Ordinary World": "Paul Edgecomb works as a death row supervisor in a 1930s Louisiana prison, accustomed to the grim routine of executions.",
      "Call to Adventure": "John Coffey arrives, a mysterious inmate whose gentle nature and supernatural abilities challenge Paul's perceptions.",
      "Trials": "Paul navigates the complexities of Coffey’s innocence, the cruelty of fellow guards, and the moral ambiguity of justice.",
      "Ordeal": "Faced with Coffey’s impending execution despite evidence of his innocence, Paul confronts the limits of his power and the system’s flaws.",
      "Return": "Paul carries Coffey’s gift and story into old age, forever changed by the experience, embodying a deeper understanding of compassion."
    },
    "Story Circle": {
      "You": "Paul Edgecomb, a seasoned death row officer, is grounded in law and order within a harsh prison environment.",
      "Need": "He needs to reconcile the brutal realities of his job with his innate sense of justice and humanity.",
      "Go": "John Coffey’s arrival disrupts the status quo, leading Paul to question everything he believes about guilt and punishment.",
      "Search": "Paul investigates Coffey’s case and witnesses his supernatural healing, searching for truth beyond appearances.",
      "Find": "He finds undeniable proof of Coffey’s innocence and goodness, along with the cruel corruption around him.",
      "Take": "Paul must accept the painful reality that the system will still carry out the execution, bearing the emotional weight of this injustice.",
      "Return": "He returns to his life changed, carrying Coffey’s legacy and the scars of his moral struggle into old age.",
      "Change": "Paul transforms from a detached officer into a compassionate man who understands the complexity of justice, mercy, and humanity."
    }
  }
}