{
  "title": "The Good, the Bad and the Ugly",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "A desolate, war-torn landscape introduces the harsh world where survival is brutal and morality blurred.",
      "Theme Stated": "In a world defined by greed and violence, trust is scarce, and everyone is chasing their own form of justice.",
      "Set-Up": "Blondie (The Good), Tuco (The Ugly), and Angel Eyes (The Bad) are introduced as morally ambiguous characters, each with their own motivations and survival tactics amidst the chaos of the Civil War.",
      "Catalyst": "Tuco escapes execution with Blondie's help, setting their uneasy partnership into motion and drawing them both into the hunt for buried Confederate gold.",
      "Debate": "The uneasy alliance between Blondie and Tuco, punctuated by betrayal and necessity, questions if survival means sacrificing loyalty or if there's room for honor even among thieves.",
      "Break into Two": "The trio learns of the buried treasure's existence, officially embarking on a treacherous and violent quest that pits them against each other and the war-torn world around them.",
      "B Story": "The backdrop of the American Civil War reflects the internal conflicts of the characters, illustrating themes of chaos, survival, and shifting allegiances.",
      "Fun and Games": "A series of tense, often darkly humorous encounters showcase the cunning, gunfights, and double-crosses between the three men as they close in on the treasure.",
      "Midpoint": "Blondie double-crosses Tuco by deserting him in the desert, escalating the stakes and solidifying their bitter rivalry as Tuco fights to survive alone.",
      "Bad Guys Close In": "Angel Eyes relentlessly tracks the treasure and the two men, using violence and intimidation, while the war rages on, tightening the noose around them all.",
      "All Is Lost": "Tuco is captured and tortured by Angel Eyes, seemingly defeated, while Blondie faces the bleak reality of betrayal and loneliness.",
      "Dark Night of the Soul": "Both men confront their vulnerabilities and the cost of their greed, reflecting on what truly drives them beyond mere survival or wealth.",
      "Break into Three": "Blondie rescues Tuco, and despite their antagonism, they form a temporary truce to outwit Angel Eyes and claim the gold together.",
      "Finale": "In the legendary three-way standoff at the cemetery, Blondie uses wit and sharpshooting to outmaneuver Angel Eyes and Tuco, securing the gold and a complex resolution to their intertwined fates.",
      "Final Image": "Blondie rides away alone, leaving Tuco alive but cheated, symbolizing the enduring ambiguity of moral lines in a ruthless world."
    },
    "Hero’s Journey": {
      "Ordinary World": "Blondie lives as a lone bounty hunter, and Tuco survives through scams and petty crimes amid the chaos of the Civil War.",
      "Call to Adventure": "Tuco and Blondie form an uneasy partnership after Blondie saves Tuco from hanging, setting them on a path toward the hidden treasure.",
      "Trials": "The two navigate deserts, battle enemy soldiers, and engage in shootouts, all while evading and confronting Angel Eyes, who seeks the same treasure.",
      "Ordeal": "Tuco’s capture and torture by Angel Eyes presents the darkest moment, testing the will and resolve of both men individually and their fragile alliance.",
      "Return": "Blondie rescues Tuco, and together they face Angel Eyes in the final duel, culminating in Blondie's victory and the ambiguous fate of their partnership."
    },
    "Story Circle": {
      "You": "Blondie and Tuco, two outlaws shaped by a brutal, lawless world, each seeking fortune and survival.",
      "Need": "Both need the gold to escape poverty and chaos, but also seek respect and control in a world that offers neither freely.",
      "Go": "They form an uneasy alliance, embarking on a perilous journey through war-ravaged lands to find the buried treasure.",
      "Search": "Their path is fraught with deception, battles, and shifting loyalties, forcing them to confront their own morality and trust issues.",
      "Find": "They locate the cemetery where the gold is buried, but Angel Eyes arrives, turning the search into a deadly standoff.",
      "Take": "In a tense three-way duel, Blondie strategically claims the treasure, outsmarting both Angel Eyes and Tuco.",
      "Return": "Blondie rides away with the gold, leaving Tuco alive but cheated, illustrating the fragile nature of their alliance and the cost of greed.",
      "Change": "Blondie remains a loner, hardened yet pragmatic, while Tuco is left to reckon with betrayal, embodying the film’s exploration of morality in a merciless world."
    }
  }
}