{
  "title": "The Shawshank Redemption",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Andy Dufresne, a calm and composed banker, is sentenced to life imprisonment for the murder of his wife and her lover, setting the bleak tone of Shawshank prison.",
      "Theme Stated": "Red's narration hints at hope and freedom: 'Hope is a dangerous thing. Hope can drive a man insane.'",
      "Set-Up": "Andy arrives at Shawshank, confronts the brutal reality of prison life, and begins to build relationships, especially with Red, establishing the world and characters.",
      "Catalyst": "Andy offers financial advice to the corrupt warden, gaining a small measure of protection and influence within the prison hierarchy.",
      "Debate": "Andy struggles with the despair of prison life versus the flicker of hope he maintains, questioning whether he can endure or must surrender to the system.",
      "Break into Two": "Andy commits to using his skills to improve life in Shawshank, setting up the transformative journey inside the prison walls.",
      "B Story": "The deepening friendship and trust between Andy and Red, representing hope, resilience, and human connection.",
      "Fun and Games": "Andy revitalizes the prison library, helps inmates with education and finances, and subtly challenges the corrupt system, showing small victories and moments of humanity.",
      "Midpoint": "Andy escapes the wrath of the guards and the warden’s suspicion by secretly laundering money, a turning point that reveals his cunning and long-term plan.",
      "Bad Guys Close In": "The warden grows suspicious and oppressive, the prison environment becomes more dangerous, and Red faces his own institutionalization fears.",
      "All Is Lost": "Andy is framed for the murder of a fellow inmate and placed in solitary confinement, seeming to lose all hope and face ultimate defeat.",
      "Dark Night of the Soul": "In isolation, Andy reflects deeply, reinforcing his resolve and hope, as Red contemplates his life sentence and the possibility of freedom beyond the walls.",
      "Break into Three": "Andy reveals his escape plan through the symbolic tunnel and rock hammer, embodying his unwavering hope and meticulous patience.",
      "Finale": "Andy emerges free, exposes the warden’s corruption through evidence he’s hidden, and helps Red find hope and freedom, culminating in their reunion on the beach.",
      "Final Image": "Red walking toward the ocean, hopeful and free, echoing the opening image but transformed – from despair to liberation."
    },
    "Hero’s Journey": {
      "Ordinary World": "Andy lives a quiet life as a banker before his accusation and sentencing plunge him into the harsh world of Shawshank prison.",
      "Call to Adventure": "Arrival at Shawshank forces Andy to confront survival within a brutal and corrupt prison system.",
      "Trials": "Endures physical violence, mental isolation, and corruption; builds alliances, notably with Red; uses his intellect to navigate prison politics.",
      "Ordeal": "Faces solitary confinement and false accusations but emerges stronger and more determined, revealing his true resilience and hope.",
      "Return": "Escapes prison through a secret tunnel, exposes corruption, and reunites with Red, symbolizing rebirth and freedom."
    },
    "Story Circle": {
      "You": "Andy Dufresne, a man wrongfully convicted, seeking purpose in a hopeless place.",
      "Need": "A longing for freedom, meaning, and justice beyond the prison walls.",
      "Go": "Accepts the harsh reality of Shawshank and begins to adapt and influence the prison environment.",
      "Search": "Uses his banking skills and intelligence to gain favor, build the library, and secretly plan his escape.",
      "Find": "Discovers inner strength, hope, and the means to outsmart the system, even when all seems lost.",
      "Take": "Endures solitary confinement and betrayal but remains steadfast, culminating in his daring escape.",
      "Return": "Emerges free, exposes the corruption that imprisoned him, and reconnects with Red, offering a new life and hope.",
      "Change": "Transforms from a prisoner defined by injustice to a symbol of hope, resilience, and redemption."
    }
  }
}