{
  "title": "The Green Mile",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Paul Edgecomb, an elderly man, sits in a nursing home, reflecting on his past as a death row corrections officer.",
      "Theme Stated": "The nature of justice, mercy, and the supernatural is questioned as Paul recalls the extraordinary events on the Green Mile.",
      "Set-Up": "Paul's daily routine on death row is established, introducing key characters like John Coffey, the gentle giant with mysterious powers, and the complex dynamics among the guards and inmates.",
      "Catalyst": "John Coffey is brought to the Mile, accused of a horrific crime, immediately setting suspicion and curiosity in motion.",
      "Debate": "Paul and the guards grapple with Coffey’s innocence and the moral implications of their roles; they witness his healing abilities, challenging their beliefs.",
      "Break into Two": "Paul decides to secretly investigate Coffey’s powers and innocence, stepping into an uncertain moral and supernatural world.",
      "B Story": "The relationship between Paul and John Coffey deepens, highlighting themes of compassion, faith, and redemption.",
      "Fun and Games": "Moments of awe and subtle miracles unfold as Coffey heals Paul’s urinary infection and resurrects Mr. Jingles, the mouse, bringing light into the grim environment.",
      "Midpoint": "Paul fully believes in Coffey’s innocence and powers after Coffey heals Paul’s wife’s brain tumor, marking a point of no return.",
      "Bad Guys Close In": "Percy Wetmore’s cruelty escalates, tensions rise, and the true evil embodied by the real murderer, William Wharton, threatens to destroy the fragile hope on the Mile.",
      "All Is Lost": "Wharton kills Mr. Jingles and attacks the guards, leading to chaos, and Coffey’s fate seems sealed despite his innocence.",
      "Dark Night of the Soul": "Paul wrestles with the injustice of executing a man who has done nothing wrong but wonders if mercy is possible within the system.",
      "Break into Three": "Paul resolves to honor Coffey’s wish to ease his suffering, acknowledging the impossibility of changing the system but seeking personal redemption.",
      "Finale": "Coffey willingly accepts execution, using his final moments to heal and provide peace, while Paul and the guards confront the moral weight of their actions.",
      "Final Image": "Back in the nursing home, an aged Paul carries the burden of immortality and the memories of mercy and loss, forever changed by the Green Mile."
    },
    "Hero’s Journey": {
      "Ordinary World": "Paul Edgecomb is a seasoned death row supervisor, accustomed to routine and the harsh realities of justice.",
      "Call to Adventure": "The arrival of John Coffey, a condemned man with miraculous healing powers, challenges Paul’s understanding of good and evil.",
      "Trials": "Paul witnesses Coffey’s miracles, confronts the cruelty of fellow guards and inmates, and investigates the truth behind the crime Coffey is accused of.",
      "Ordeal": "Paul faces the moral crisis of whether to allow Coffey’s execution despite knowing his innocence and supernatural gifts, struggling with his conscience and the law.",
      "Return": "Paul carries the weight of his experiences into old age, forever changed by the lessons of mercy, justice, and humanity learned on the Green Mile."
    },
    "Story Circle": {
      "You": "Paul Edgecomb, a pragmatic and experienced death row supervisor, living within the confines of the prison system.",
      "Need": "To reconcile his duty with his growing doubts about justice and the humanity of the condemned, especially John Coffey.",
      "Go": "Paul confronts the arrival of Coffey, stepping into a world where miracles challenge his beliefs.",
      "Search": "He investigates Coffey’s powers and innocence, navigating prison politics, cruelty, and supernatural phenomena.",
      "Find": "Paul discovers Coffey’s true nature as a healer and innocent man suffering unjustly.",
      "Take": "He must accept the painful truth and the limitations of the system, deciding to honor Coffey’s final wishes.",
      "Return": "Paul returns to his life, burdened with the memory and moral responsibility of the events on the Mile.",
      "Change": "He is transformed by his experiences, carrying a profound empathy and sorrow that shapes his remaining years."
    }
  }
}