{
  "title": "Your Name.",
  "frameworks": {
    "Save the Cat": {
      "Opening Image": "Mitsuha, a high school girl in the rural town of Itomori, looks up at the stars, yearning for a life beyond her small town.",
      "Theme Stated": "The idea that connection transcends time and space is hinted when Mitsuha wishes to escape her fate and Taki wonders about the meaning behind their strange dreams.",
      "Set-Up": "We see Mitsuha's everyday struggles in Itomori and Taki's busy life in Tokyo; both feel incomplete and disconnected, setting up their contrasting worlds and desires.",
      "Catalyst": "Mitsuha and Taki inexplicably begin switching bodies intermittently, waking up in each other's lives and experiencing each other's worlds firsthand.",
      "Debate": "They grapple with the confusion and chaos of living each other's lives, questioning if this strange connection is a blessing or a curse, and how to communicate across the divide.",
      "Break into Two": "They decide to actively leave messages and clues for each other, embracing the mystery and attempting to influence each other's realities.",
      "B Story": "The growing emotional bond between Mitsuha and Taki deepens beyond their physical switches, hinting at a profound connection that defies explanation.",
      "Fun and Games": "Taki and Mitsuha experiment with each other's lives, causing comedic misadventures and gaining empathy for the other's world, while their relationship blooms through shared experiences.",
      "Midpoint": "Taki visits Itomori to meet Mitsuha in person, only to discover the town was destroyed by a comet three years earlier, revealing their timelines are out of sync—raising the stakes and emotional tension.",
      "Bad Guys Close In": "Time runs out as Taki tries desperately to alter history and prevent the disaster, while the cosmic forces and their fading memories threaten to sever their bond forever.",
      "All Is Lost": "Taki fails to find Mitsuha or convince anyone about the impending disaster; their connection fades, and they begin to forget each other entirely.",
      "Dark Night of the Soul": "Both Mitsuha and Taki are engulfed in loneliness and despair, haunted by faint memories of each other and the life they shared but cannot fully recall.",
      "Break into Three": "Driven by a mysterious pull, they independently set out to find one another at the shrine, hoping to bridge the impossible gap between their worlds.",
      "Finale": "In a poignant climax, Mitsuha and Taki meet on the stairs at twilight, their memories flooding back as they grasp each other's hands, defying time and fate to forge a new future together.",
      "Final Image": "Years later, Mitsuha and Taki, now strangers, pass each other on a Tokyo street, feeling an inexplicable connection; they stop, smile, and finally speak each other's names—an eternal bond rekindled."
    },
    "Hero’s Journey": {
      "Ordinary World": "Mitsuha’s quiet life in Itomori and Taki’s bustling Tokyo existence, both feeling disconnected from their true selves and desires.",
      "Call to Adventure": "The inexplicable body-swapping phenomenon that forces Mitsuha and Taki to live each other's lives.",
      "Trials": "Navigating each other's daily routines, managing misunderstandings, and leaving messages to communicate across time and space.",
      "Ordeal": "Discovering the comet disaster and Itomori's destruction in the past; the challenge to save Mitsuha’s town and their bond despite temporal separation.",
      "Return": "Their emotional reunion on the stairs, transcending time, followed by years of separation and eventual reconnection through shared memory and names spoken aloud."
    },
    "Story Circle": {
      "You": "Mitsuha and Taki, two strangers yearning for something beyond their current lives.",
      "Need": "A deep desire to understand their strange connection and find meaning in their intertwined fates.",
      "Go": "They begin switching bodies and actively communicating through notes and actions to influence each other's worlds.",
      "Search": "Taki’s journey to Itomori and their efforts to prevent the impending catastrophe that threatens Mitsuha’s town and life.",
      "Find": "The painful realization of their temporal disconnect and the limits of their power to change fate, as memories start to fade.",
      "Take": "Summoning courage and willpower, they defy time and memory, racing to meet each other before their connection disappears forever.",
      "Return": "Their emotional meeting at twilight, a moment of clarity and reunion, followed by years of searching and longing in their separate lives.",
      "Change": "They grow from isolated individuals into two souls united by love and memory, finally breaking the cycle of loss and separation."
    }
  }
}